Repository: MachineTeachingEdu/machine-teaching
Catalog: machineteaching/locale/*/LC_MESSAGES/django.po
Languages: pt_br

source: is a student of Information Systems at UNIRIO. Aiming to combine his interest in development and new technologies with his education, he noticed in Machine Teaching a way to leverage his studies in the field and to promote a tool capable of facilitating and boosting the relationship of more and more people with programming. Currently, he is a volunteer student in Scientific Initiation.
pt_br: é aluno de Sistemas de Informação na UNIRIO. Visando unir seu interesse por desenvolvimento e por novas tecnologias com sua formação, notou no Machine Teaching uma forma de alavancar seus estudos na área além de poder promover uma ferramenta capaz de facilitar e impulsionar o relacionamento de cada vez mais pessoas com a programação. No momento, é aluno voluntário de Iniciação Científica.

source: is a Computer Science student at UFRJ. He has a great interest in technology-focused education and saw the project as an opportunity to combine his interest with his education by participating in the selection process and working with the platform's functional and infrastructure areas. Currently, he is a Scientific Initiation student in the project with a private scholarship.
pt_br: é aluno de Ciência da Computação da UFRJ. Tem grande interesse por educação voltada a tecnologia e enxergou no projeto uma chance de unir seu interesse à sua formação, participando do processo seletivo e trabalhando com as áreas de funcionalidades e infraestrutura da plataforma. Atualmente, é aluno de Iniciação Científica do projeto com bolsa privada.

source: is an undergraduate student in Electronic and Computer Engineering at UFRJ, with an interest in data science and artificial intelligence. She is being advised by Laura Moraes on her final project, which studies whether LLM models (Large Language Models like GPT and LLAMA) are good study tools for beginners in Python programming logic.
pt_br: graduanda em Engenharia Eletrônica e de Computação na UFRJ, com interesse na área de ciência de dados e inteligência artificial. Orientanda da Laura Moraes no trabalho de final de curso que estuda se modelos de LLM (Large Language Models como GPT e LLAMA) são boas ferramentas de estudo para iniciantes em lógica de programação em Python.

source: is a student of Information Systems at UNIRIO. With the goal of learning more about programming and its technologies, he found in Machine Teaching an opportunity to deepen his knowledge in the field and assist in developing a tool capable of enhancing the efficiency of programming learning. Currently, he is a Scientific Initiation scholarship holder from FAPERJ.
pt_br: é um aluno de Sistemas de Informação na UNIRIO. Com o objetivo de conhecer mais sobre programação e suas tecnologias, encontrou no Machine Teaching uma oportunidade de aprofundar os seus conhecimentos na área e auxiliar no desenvolvimento de uma ferramenta que será capaz de elevar a eficiência do aprendizado em programação. No momento, é bolsista de Iniciação Científica pela FAPERJ.

source: is an Information Systems student at UNIRIO. Seeking to deepen his knowledge and experiences in the field of programming, he saw in Machine Teaching the possibility to expand his studies in the area and collaborate in the development of a project that contributes to the learning and teaching of programming. Currently, he works on the project as a PRADIG (Programa de Acompanhamento de Discente de Graduação) scholarship holder.
pt_br: é aluno de Sistemas de Informação na UNIRIO. Buscando aprofundar seus conhecimentos e experiências na área de programação, viu no Machine Teaching a possibilidade de expandir seus estudos na área e colaborar no desenvolvimento de um projeto que contribui para o aprendizado e ensino de programação. Atualmente, atua no projeto como aluno bolsista PRADIG (Programa de Acompanhamento de Discente de Graduação).
