Repository: MachineTeachingEdu/machine-teaching
Catalog: machineteaching/locale/*/LC_MESSAGES/django.po
Languages: pt_br

source: No
pt_br: Não

source: Yes
pt_br: Sim

source: Class code
pt_br: Código da turma

source: Course
pt_br: Curso

source: Registration
pt_br: Matrícula

source: University
pt_br: Universidade

source: Did you have any programming experience before this course?
pt_br: Você teve alguma experiência com programação antes desse curso?

source: I accept the
pt_br: Eu aceito os

source: Terms and Conditions
pt_br: Termos e Condições

source: I've read the
pt_br: Eu li a

source: Privacy Policy
pt_br: Política de Privacidade

source: Email addresses must be unique.
pt_br: O endereço de email deve ser único.

source: Invalid Class Code.
pt_br: Código da turma inválido

source: Class
pt_br: Turma

source: Chapter
pt_br: Aula

source: You don't have authorization to view this class.
pt_br: Você não tem autorização para ver essa aula.

source: Code
pt_br: Código

source: Multiple Choice
pt_br: Múltipla escolha

source: Text
pt_br: Texto

source: The date must be in the format "yyyy-mm-dd" and must be valid.
pt_br: A data deve estar no formato "yyyy-mm-dd" e deve ser válida.

source: The time must be in the format "HH:MM" and must be valid.
pt_br: O horário deve estar no formato "HH:MM" e deve ser válido.

source: Passed
pt_br: Passou

source: Failed
pt_br: Falhou

source: Skipped
pt_br: Pulou

source: No attempt
pt_br: Sem tentativa

source: You
pt_br: Você

source: Your class
pt_br: Sua turma

source: Student
pt_br: Aluno

source: error(s)
pt_br: erro(s)

source: Errors
pt_br: Erros

source: day(s)
pt_br: dia(s)

source: Time (days)
pt_br: Tempo (dias)

source: Outcomes
pt_br: Resultados

source: Attempts
pt_br: Tentativas

source: avg
pt_br: média

source: Time
pt_br: Tempo

source: Time (minutes)
pt_br: Tempo (minutos)

source: Solved problems
pt_br: Problemas resolvidos

source: Attempts per problem
pt_br: Tentativas por problema

source: Time per problem (minutes)
pt_br: Tempo por problema (minutos)

source: Problem
pt_br: Problema

source: Chapters
pt_br: Aulas

source: Problems
pt_br: Problemas

source: OnlineClass
pt_br: Turma

source: OnlineClasses
pt_br: Turmas

source: Deadline
pt_br: Data de entrega

source: Deadlines
pt_br: Prazos

source: Professors
pt_br: Professores

source: User profile
pt_br: Perfil do usuário

source: User profiles
pt_br: Perfis dos usuários

source: Solution
pt_br: Solução

source: Solutions
pt_br: Soluções

source: Test Case
pt_br: Caso de Teste

source: Test Cases
pt_br: Casos de Teste

source: User log
pt_br: Log do usuário

source: User logs
pt_br: Logs dos usuários

source: Page access
pt_br: Acesso

source: Page accesses
pt_br: Acessos

source: Recommendations
pt_br: Recomendações

source: Comment
pt_br: Comentário

source: Drop out model
pt_br: Risco de abandono

source: Drop out models
pt_br: Risco de abandono

source: Collaborator
pt_br: Coaborador

source: Collaborators
pt_br: Colaboradores

source: Home
pt_br: Início

source: Welcome to
pt_br: Bem-vindo ao

source: About this research
pt_br: Sobre a pesquisa

source: Check the
pt_br: Veja os

source: and the
pt_br: e a

source: Close
pt_br: Fechar

source: Start
pt_br: Começar

source: Create account
pt_br: Criar conta

source: Watch
pt_br: Assista aos

source: tutorials
pt_br: tutoriais

source: on how to use Machine Teaching
pt_br: sobre como usar o Machine Teaching

source: Our goals
pt_br: Nossos objetivos

source: Understand students' learning processes
pt_br: Entender os processos de aprendizado dos alunos

source: Improve teaching methodologies
pt_br: Melhorar metodologias de aprendizado

source: Stimulate students to learn the Python language
pt_br: Estimular o aprendizado da linguagem Python

source: GPL-3.0 License
pt_br: Licença GPL-3.0

source: It is important to understand why students succeed or fail when taking a course so we can improve teaching methods by identifying students needs and to provide personalized education. Smart learning content is defined as visualizations, simulations and web-based environments that provide outputs for students based on the students input [1]. The adoption of smart learning content in classrooms and in self-learning environments motivates students [2]–[5], improves student learning, decreases student dropout or failure [2], [6]–[8] while increasing their self-confidence, especially in female students [6].
pt_br: É importante entender os motivos por que alguns alunos são mais bem-sucedidos do que outros ao fazer um curso, para que possamos aprimorar os métodos de ensino ao identificar as necessidades dos alunos e oferecer uma educação personalizada. Um ambiente de aprendizagem inteligente é aquele que provê visualizações, simulações e inferências aos alunos e educadores a partir de dados coletados dinamicamente [1]. Sabe-se que a adoção de um ambiente de aprendizagem inteligente em salas de aula e em ambientes de auto-aprendizagem ajuda a motivar os alunos [2]-[5], melhorar a aprendizagem, diminuir os casos de abandono e a reprovação [2], [6]-[8], enquanto aumenta a autoconfiança dos alunos, especialmente em estudantes do sexo feminino [6].

source: Also, Python is a general-purpose language, which means it can be used in a large variety of projects. This can be great to stimulate students, since they can work in projects they actually relate to. Python is also user-friendly and for the past seven years, it has been the fastest-growing major programming language [9], being correlated with trending careers, such as DevOps and Data Scientist [10]. According to the 2015 review [8], only 11 of the Educational Data Mining and Learning Analytics papers about programming courses reported using Python as the course language. However, this is changing. A 2017 review on the Introductory Programming courses in Australasia universities [11] reported a shift from Java to Python in the past years and the 2018 review on Introductory Programming literature [12] already presents a higher number of papers using Python as the course language. Nonetheless, even though we already have different tools to support online learning, it is still hard to find open datasets containing student submissions for Python problems and related information that can be important to get a better insight on students knowledge.
pt_br: Além disso, o Python é uma linguagem de propósito geral, o que significa que pode ser usada em uma grande variedade de projetos. Isso é ótimo para estimular os alunos, pois eles podem trabalhar em projetos com os quais realmente se identificam. Python também possui uma interface amigável e, nos últimos sete anos, tem sido a linguagem de programação com maior crescimento em termos de adoção [9], estando correlacionada com carreiras em alta, como DevOps e Cientista de Dados [10]. De acordo com a revisão de 2015 [8],apenas 11 dos artigos de Mineração de Dados Educacionais e Learning Analytics sobre cursos de programação relataram o uso de Python como a linguagem utilizada no curso. No entanto, isso está mudando. Uma revisão de 2017 sobre os cursos de Introdução à Programação nas universidades da Australásia [11] relatou uma mudança de Java para Python nos últimos anos enquanto a revisão de 2018 [12] já apresentou um número maior de artigos usando Python como a linguagem principal do curso. Ainda assim, embora já tenhamos diferentes ferramentas para apoiar a aprendizagem online, ainda é difícil encontrar bancos de dados abertos contendo respostas e submissões de alunos para problemas em Python e outras informações importantes para se obter uma melhor percepção do conhecimento dos alunos.

source: These factors motivate our objective: the creation, deployment and use of online intelligent systems in Introduction to Programming classes using the Python language as a way to uncover students’ difficulties, to understand their knowledge and to provide timely feedback to keep students engaged.
pt_br: As condições apresentadas motivam nossos principais objetivos: o desenvolvimento, a implantação e o uso de sistemas inteligentes online em aulas de Introdução à Programação usando a linguagem Python como uma forma de descobrir as dificuldades dos alunos, compreender seus conhecimentos e processos cognitivos de aprendizado e fornecer feedback para mantê-los envolvidos e engajados.

source: References
pt_br: Referências

source: Interested? Take a look at
pt_br: Se interessou? Veja mais em

source: Our
pt_br: Nosso

source: Team
pt_br: Equipe

source: Support
pt_br: Apoio

source: Universities using this research
pt_br: Universidades que utilizam o projeto

source: Current problem
pt_br: Problema atual

source: Past problems
pt_br: Problemas passados

source: Classes
pt_br: Turmas

source: Satisfaction Form
pt_br: Formulário de Satisfação

source: Tutorials
pt_br: Tutoriais

source: Hello
pt_br: Olá

source: Administration
pt_br: Administração

source: Change class
pt_br: Trocar de turma

source: Logout
pt_br: Sair

source: Answer the satisfaction form!
pt_br: Responda ao formulário de satisfação!

source: Register your course
pt_br: Cadastre seu curso

source: Your course
pt_br: Seu curso

source: Other course
pt_br: Outro curso

source: Register
pt_br: Cadastrar

source: Update your informations
pt_br: Atualize suas informações

source: Add you university
pt_br: Adicione sua instituição

source: Add your university registration
pt_br: Adicione sua matrícula

source: Add chapter
pt_br: Adicionar aula

source: Name
pt_br: Nome

source: Add
pt_br: Adicionar

source: Search
pt_br: Pesquisar

source: Class progress
pt_br: Progresso da turma

source: on all problems
pt_br: em todos os problemas

source: class performance by problem
pt_br: desempenho da turma por problema

source: Students
pt_br: Alunos

source: Time per chapter (avg)
pt_br: Tempo por aula (média)

source: Delays
pt_br: Atrasos

source: Time per problem (avg)
pt_br: Tempo por problema (média)

source: days
pt_br: dias

source: Progress
pt_br: Progresso

source: Time to finish (avg)
pt_br: Tempo (média)

source: Delays (students)
pt_br: Atrasos (alunos)

source: solving problems performance
pt_br: desempenho resolvendo problemas

source: average attempts and time to complete a problem
pt_br: média de tentativas e tempo para acertar um problema

source: to end a chapter
pt_br: para finalizar uma aula

source: Not finished
pt_br: Não entregue

source: Finished late
pt_br: Atraso

source: max. time
pt_br: tempo máx.

source: Drop out risk
pt_br: Risco de abandono

source: Show inactive classes
pt_br: Mostrar turmas inativas

source: Hide inactive classes
pt_br: Esconder turmas inativas

source: Start date
pt_br: Data de início

source: Manage class
pt_br: Gerenciar turma

source: Active
pt_br: Ativo

source: Inactive
pt_br: Inativo

source: New class
pt_br: Nova turma

source: Class name
pt_br: Nome da turma

source: Create
pt_br: Criar

source: Change
pt_br: Trocar

source: You finished all available problems in
pt_br: Você terminou todos os problemas disponíveis no modo

source: Sequential
pt_br: Sequencial

source: mode. You can:
pt_br: Você pode:

source: Go to
pt_br: Ir para o modo

source: and come back to skipped problems.
pt_br: e voltar aos problemas pulados.

source: Random
pt_br: Aleatório

source: mode and try other problems.
pt_br: e tentar outros problemas.

source: mode. You can go to
pt_br: . Você pode ir para o modo

source: mode and do new problems.
pt_br: e fazer novos problemas.

source: Total progress
pt_br: Progresso do aluno

source: in all problems
pt_br: em todos os problemas

source: Next problem
pt_br: Próximo problema

source: All problems have been finalized
pt_br: Todos os problemas foram finalizados

source: before you get right a problem
pt_br: antes de acertar um problema

source: No errors made
pt_br: Nenhum erro cometido

source: Average time
pt_br: Tempo médio

source: to perform a problem
pt_br: para acertar um problema

source: No problems completed
pt_br: Nenhum problema resolvido

source: Less than 1 day
pt_br: Menos de 1 dia

source: No chapters completed
pt_br: Nenhuma aula finalizada

source: See more infos
pt_br: Veja mais

source: Current chapter
pt_br: Aula atual

source: Estimated time to finish this chapter
pt_br: Tempo estimado para finalizar esta aula

source: minutes
pt_br: minutos

source: Finished chapter
pt_br: Aula finalizada

source: There are still no chapters or all deadlines have expired
pt_br: Não há aula para mostrar ou todos os prazos expiraram

source: performance per problem
pt_br: desempenho da turma por problema

source: Title
pt_br: Título

source: Multiple choice
pt_br: Múltipla escolha

source: Position
pt_br: Posição

source: Add problem
pt_br: Adicionar problema

source: Tip
pt_br: Dica

source: Test case generator
pt_br: Gerador de casos de teste

source: Options
pt_br: Opções

source: Add Option
pt_br: Adicionar opção

source: Correct answer
pt_br: Resposta

source: Delete
pt_br: Excluir

source: Export CSV
pt_br: Exportar CSV

source: Passed at
pt_br: Passou em

source: Filter
pt_br: Filtrar

source: Comments
pt_br: Comentários

source: Last submission
pt_br: Última tentativa

source: See submitted solutions
pt_br: Ver soluções enviadas

source: Test cases
pt_br: Casos de teste

source: Your answer
pt_br: Sua resposta

source: Add comment
pt_br: Adicionar comentário

source: Next
pt_br: Próximo

source: Input:
pt_br: Entrada:

source: Expected output:
pt_br: Retorno esperado:

source: Your output:
pt_br: Seu retorno:

source: Loading...
pt_br: Carregando...

source: Edit
pt_br: Editar

source: Cancel
pt_br: Cancelar

source: Save
pt_br: Salvar

source: Main errors
pt_br: Erros mais comuns

source: Date (yyyy-mm-dd)
pt_br: Data (yyyy-mm-dd)

source: Time (H:M)
pt_br: Hora (H:M)

source: Skip
pt_br: Pular

source: Run
pt_br: Executar

source: Answer
pt_br: Responder

source: Error
pt_br: Erro

source: The solution uses <strong>print</strong> command, breaking the rule that the entire result of the function must be returned exclusively through its return values.
pt_br: A solução faz uso do comando <strong>print</strong>, quebrando a regra de que todo o resultado da função deve ser devolvido exclusivamente através de valores de retorno da mesma.

source: See class
pt_br: Ver turma

source: See solution
pt_br: Ver solução

source: No submission
pt_br: Sem submissões

source: error
pt_br: erro

source: on average
pt_br: em média

source: Average errors
pt_br: Média de erros

source: per chapter
pt_br: por aula

source: Day
pt_br: Dia

source: Time
pt_br: Hora

source: Test cases
pt_br: Casos de teste

source: Error (Python)
pt_br: Erro (Python)

source: See submitted solution
pt_br: Ver solução enviada

source: See chapter
pt_br: Ver aula

source: Login
pt_br: Entrar

source: Password
pt_br: Senha

source: Forgot password?
pt_br: Esqueceu a senha?

source: Password reset
pt_br: Recuperar senha

source: Your password has been set. You may go ahead and
pt_br: Sua senha foi redefinida. Você pode ir em frente e

source: sign in
pt_br: fazer login

source: now.
pt_br: agora.

source: Change password
pt_br: Redefinir senha

source: We've emailed you instructions for setting your password, if an account exists with the email you entered. You should receive them shortly.
pt_br: Enviamos por e-mail instruções para redefinir sua senha, se existir uma conta com o e-mail que você digitou. Você deve recebê-las em breve.

source: If you don't receive an email, please make sure you've entered the address you registered with, and check your spam folder.
pt_br: Se você não recebeu um e-mail, certifique-se de inserir o endereço com o qual se cadastrou e verifique sua caixa de spam.

source: Submit
pt_br: Enviar

source: First name
pt_br: Nome

source: Last name
pt_br: Sobrenome

source: Password confirmation
pt_br: Confirmação de senha

source: 1) Your password can't be too similar to your other personal information. 2) Your password must contain at least 8 characters. 3) Your password can't be a commonly used password. 4) Your password can't be entirely numeric.
pt_br: 1) Sua senha não pode ser parecida com com outra informação pessoal. 2) Sua senha deve conter no mínimo 8 caracteres. 3) Sua senha não pode ser uma senha comumente usada. 4) Sua senha não pode ser totalmente númerica.

source: Finished
pt_br: Finalizado

source: Problem solutions
pt_br: Solução

source: Student solutions
pt_br: Solução

source: New problem
pt_br: Novo problema

source: Edit profile
pt_br: Perfil do usuário

source: home
pt_br: início

source: has bachelor degree (1975) and master 's degree in Electrical Engineering at Pontificia Catholic University of Rio de Janeiro. In 1987, he finished his doctorate degree at Imperial College of Science, Technology and Medicine, University of London. At the moment he’s a teacher from Federal University of Rio de Janeiro where he leads the Artificial Intelligence sector from the Systems and Computing department at COPPE (PESC/COPPE). He's been a visiting researcher at University of Salamanca, from Spain, since 2002. His main research interests are Pattern Classification and Machine Learning. He was the founder president of the Brazilian Society of Computational Intelligence and received the Science and Innovation Santander Bank Award in 2006. He was the Laura O. Moraes doctoral supervisor.
pt_br: possui bacharelado (1975) e mestrado (1981) em Engenharia Elétrica pela Pontifícia Universidade Católica do Rio de Janeiro. Em 1987, ele terminou seu doutorado no Imperial College of Science, Technology and Medicine, University of London. Atualmente é Professor da Universidade Federal do Rio de Janeiro onde é chefe do setor de Inteligência Artificial do Departamento de Sistemas e Computação da COPPE (PESC/COPPE). É pesquisador visitante na Universidade de Salamanca, Espanha, desde 2002. Seus principais interesses de pesquisa são Classificação de Padrões e Aprendizado de Máquina. Ele foi o presidente fundador da Sociedade Brasileira de Inteligência Computacional e recebeu o Prêmio Banco Santander de Ciência e Inovação em 2006. Foi orientador de doutorado de Laura O. Moraes na criação deste projeto.

source: is a professor at the UFRJ Computational Institute and has numerous publications in the educational technologies and computer science learning field. She has a great interest in the didactics of computing and information technology applied to education, by leading a group research group on these topics. She is co-responsible for the development and management of the methodology and educational didactic materials for programming courses offered by the Computing Institute to students from almost all graduating courses at UFRJ in the exact sciences field (including, for example, graduating courses in mathematics, meteorology, and all engineering disciplines).
pt_br: é professora do Instituto de Computação da UFRJ e possui diversas publicações na área de tecnologias para educação e ensino de computação. Tem grande interesse na área de didática da computação e informática aplicada à educação, estando à frente de um grupo de pesquisa sobre estes temas. É co-responsável pela construção e gestão da metodologia e material didático dos cursos de programação oferecidos pelo Instituto de Computação aos alunos de praticamente todos os cursos de graduação da UFRJ na área de exatas (incluindo, por exemplo, cursos de graduação de matemática, meteorologia e todas as engenharias).

source: was the one who initiated the project. She developed the platform during her doctorate degree in Computer Engineering and Systems (COPPE/PESC) in the Artificial Intelligence research line. Currently, she is a professor at Colégio Pedro II and dedicates herself to research activities in the field of technology for education, particularly in computer education. In 2018, she was a fellow in the Data Science for Social Good program, where she created models for predicting individuals at risk of long-term unemployment organized by the University of Chicago with Nova SBE. In 2019, she was a finalist at the 2nd PFL Engineering PhD Summit in Switzerland, where she presented the preliminary results of the project.
pt_br: foi quem iniciou o projeto. Criou a plataforma durante seu doutorado em Engenharia de Sistemas e Computação (COPPE/PESC) na linha de pesquisa de Inteligência Artificial. Atualmente é professora do Colégio Pedro II e se dedica às atividades de pesquisa na área de tecnologia para educação, principalmente educação em computação. Em 2018, foi fellow no programa Data Science for Social Good, onde criou modelos para previsão de indivíduos em risco de desemprego longo organizado pela University of Chicago com a Nova SBE. Em 2019, foi finalista do 2nd PFL Engineering PhD Summit, na Suíça, onde apresentou os resultados preliminares do projeto.

source: is a student in the Statistics program at UFRJ. He started in the project as a student, using the Machine Teaching system during the introduction to programming course. After completing the course, he volunteered to incorporate improvements and advance the system with new functionalities. Currently, he is a Scientific Initiation student with a scholarship from CNPq in this project.
pt_br: é aluno do curso de Estatística da UFRJ. Começou no projeto como aluno, utilizando o sistema Machine Teaching durante o curso de introdução a programação. Após a finalização do curso, se voluntariou para incorporar melhorias e avançar o sistema com novas funcionalidades. Atualmente é aluno de Iniciação Científica com bolsa do CNPq neste projeto.

source: is a student in the Computer Engineering program. He became involved in the project due to his interest in programming education. He is responsible for assisting in the infrastructure of Machine Teaching, as well as implementing actions to ensure integration and continuous delivery to the project developers.
pt_br: é aluno do curso de Engenharia de Computação. Se aproximou do projeto por conta de seu interesse no ensino de programação. É responsável por auxiliar na parte de infraestrutura do Machine Teaching, e também por implementar ações que garantam integração e entrega contínua aos desenvolvedores do projeto.

source: is a Computer Science student at UFRJ. He started to work on the project by adapting Numerical Calculus questions for the platform. Currently, he is working on his undergraduate thesis in the AI field, focusing on analyzing the similarity between the codes submitted by students in Machine Teaching.
pt_br: é aluno de Ciência da Computação da UFRJ. Começou no projeto adaptando questões de Cálculo Numérico para a plataforma. Atualmente faz TCC na área de IA, focado na análise da similaridade entre os códigos submetidos pelos estudantes no Machine Teaching.

source: is a student of Information Systems at UNIRIO. She recently started to venture into the infrastructure field and saw in Machine Teaching a good opportunity to develop her knowledge by helping to improve a project that democratizes computing learning. She is currently a volunteer student in Scientific Initiation.
pt_br: é aluna de Sistemas de Informação na UNIRIO. Começou a se aventurar recentemente na área de infraestrutura e viu no Machine Teaching uma boa oportunidade de desenvolver seu conhecimento ajudando no aprimoramento de um projeto que democratiza o aprendizado da computação. Atualmente é aluna voluntária de Iniciação Científica.
